ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/sysclk/cy_sysclk.h
/***************************************************************************//**
* \file cy_sysclk.h
* \version 1.0
*
* Provides an API declaration of the sysclk driver.
*
********************************************************************************
* \copyright
* Copyright 2016, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

/**
* \defgroup group_sysclk System Clock (SysClk)
* \{
* The sysclk driver contains an API for configuring system and peripheral clocks.
* Most of the sysclk driver API functions are simple wrappers for writing to registers
* to configure or manage a particular clock.
*
* In the API reference for this driver each clock has its own section, so all the
* information to manage that clock is in the same place.
*
* \section group_sysclk_configuration Configuration Considerations
*
* \warning When the device is in the Ultra-Low Power (ULP) mode, the maximum frequency of all the clocks is limited to
* the 50 MHz with the exception for the slow clock which is limited to 25 MHz.
*
* There are no general sysclk configuration concerns. Some clocks (for example the PLL) require configuration.
* For such a clock the API provides a configuration structure and a Configure() function to set up the clock.
* See notes on individual function definitions.
*
* \section group_sysclk_more_information More Information
*
* See the Clock Component datasheet.
* See also the sysclk chapter of the device technical reference manual (TRM).
*
* \section group_sysclk_MISRA MISRA-C Compliance
* <table class="doxtable">
*   <tr>
*     <th>MISRA Rule</th>
*     <th>Rule Class (Required/Advisory)</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*   <tr>
*     <td>1.2</td>
*     <td>R</td>
*     <td>No reliance on undefined behavior.</td>
*     <td>Calculation of absolute value in FLL and PLL configure.</td>
*   </tr>
*   <tr>
*     <td>10.1</td>
*     <td>R</td>
*     <td>The value of an expression of integer type shall not be implicitly converted to a different, underlying type if the expression is complex.</td>
*     <td>Using a Cypress defined macro to access memory mapped objects.
*         Using a Cypress defined macro to divide with rounding.</td>
*   </tr>
*   <tr>
*     <td>10.3</td>
*     <td>R</td>
*     <td>A composite integer expression is being cast to a wider type.</td>
*     <td>Using a Cypress defined macro to access memory mapped objects. Calculating clock parameters.</td>
*   </tr>
*   <tr>
*     <td>10.4</td>
*     <td>R</td>
*     <td>A composite floating point expression is being cast to double, or unsigned.</td>
*     <td>Using the C library sqrt() function. Casting a floating point calculation result to an integer.</td>
*   </tr>
*   <tr>
*     <td>10.5</td>
*     <td>R</td>
*     <td>The value of an expression of integer type shall not be implicitly converted to a different, underlying type if the expression is complex.</td>
*     <td>Using a Cypress defined macro to access memory mapped objects.</td>
*   </tr>
*   <tr>
*     <td>12.1</td>
*     <td>A</td>
*     <td>Extra parentheses recommended.</td>
*     <td>Ternary operator uses constants; extra parentheses not needed.</td>
*   </tr>
*   <tr>
*     <td>13.4</td>
*     <td>R</td>
*     <td>The controlling expression of a for statement shall not contain any objects of floating type.</td>
*     <td>Scanning through a list of floating point values.</td>
*   </tr>
*   <tr>
*     <td>18.4</td>
*     <td>R</td>
*     <td>Unions shall not be used.</td>
*     <td>Clock path in \ref Cy_SysClk_PeriphGetFrequency() may use either FLL or PLL.</td>
*   </tr>
*   <tr>
*     <td>19.7</td>
*     <td>A</td>
*     <td>A function shall be used in preference to a function-like macro.</td>
*     <td>Function-like macros are used to achieve more efficient code.</td>
*   </tr>
* </table>
*
* \section group_sysclk_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_sysclk_macro           Macros
* \{
*   \defgroup group_sysclk_macro_return    Function return values
* \}
* \defgroup group_sysclk_imo             Internal Main Oscillator (IMO)
* \defgroup group_sysclk_eco             External Crystal Oscillator (ECO)
* \defgroup group_sysclk_muxes           Input Multiplexers
* \defgroup group_sysclk_fll             Frequency Locked Loop (FLL)
* \defgroup group_sysclk_pll             Phase Locked Loop (PLL)
* \defgroup group_sysclk_ilo             Internal Low-Speed Oscillator (ILO)
* \defgroup group_sysclk_pilo            Precision Internal Low-Speed Oscillator (PILO)
* \defgroup group_sysclk_calclk          Clock Measurement
* \defgroup group_sysclk_trim            Clock Trim
* \defgroup group_sysclk_wco             Watch Crystal Oscillator (WCO)
* \defgroup group_sysclk_clk_hf          High-Frequency Clocks
* \defgroup group_sysclk_clk_fast        Fast Clock
* \defgroup group_sysclk_clk_peripheral  Peripherals Clocks
* \defgroup group_sysclk_clk_slow        Slow Clock
* \defgroup group_sysclk_clk_lf          Low-Frequency Clock
* \defgroup group_sysclk_clk_timer       Timer Clock
* \defgroup group_sysclk_clk_pump        Pump Clock
* \defgroup group_sysclk_clk_bak         Backup Domain Clock
*/

#if !defined(__CY_SYSCLK_H__)
#define __CY_SYSCLK_H__

#include "cy_device_headers.h"
#include "syslib/cy_syslib.h"
#include <stdbool.h>

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/**
* \addtogroup group_sysclk_macro
* \{
*/

/** Driver major version */
#define CY_SYSCLK_DRV_VERSION_MAJOR       1

/** Driver minor version */
#define CY_SYSCLK_DRV_VERSION_MINOR       0

/**
* \addtogroup group_sysclk_returns
* \{
* Specifies return values meaning
*/
/** Command completed with no errors */
#define CY_SYSCLK_SUCCESS           0ul
/** Invalid function input parameter */
#define CY_SYSCLK_BAD_PARAM         1ul
/** Status of calibration counters: STARTED */
#define CY_SYSCLK_STARTED           7ul
/** Status of calibration counters: FINISHED */
#define CY_SYSCLK_FINISHED          8ul
/** Timeout occurred */
#define CY_SYSCLK_TIMEOUT        0x10ul
/** Clock is in an invalid state */
#define CY_SYSCLK_INVALID_STATE  0x11ul
/** \} group_sysclk_returns */
/** \} group_sysclk_macro */

/** \cond INTERNAL */
/* Generates shorter code for setting register bitfields */
#define CY_SYSCLK_CLR_SET(reg, field, value) (reg) = _CLR_SET_FLD32U((reg), field, value)
/* Calculate a / b with rounding to the nearest integer. a and b must have the same sign. */
#define CY_SYSCLK_DIV_ROUND(a, b) (((a) + ((b) / 2u)) / (b))
/* Calculate a / b with rounding up if remainder != 0. a and b must both be positive. */
#define CY_SYSCLK_DIV_ROUNDUP(a, b) ((((a) - 1u) / (b)) + 1u)
/** \endcond */

/**
* \addtogroup group_sysclk_imo
* \{
*/

/* ========================================================================== */
/* ===========================    IMO SECTION    ============================ */
/* ========================================================================== */
/*******************************************************************************
* Function Name: Cy_SysClk_ImoEnable
****************************************************************************//**
*
* Enables the internal main oscillator (IMO).
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_ImoEnable(void)
{
    SRSS->CLK_IMO_CONFIG |= _VAL2FLD(SRSS_CLK_IMO_CONFIG_ENABLE, 1u); /* 1 = enable */
}

