ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/sysclk/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_FllEnable
****************************************************************************//**
*
* Enables the FLL. The FLL should be configured before calling this function.
*
* \param timeoutus amount of time in micro seconds to wait for FLL to lock.
* If lock doesn't occur, FLL is stopped. To avoid waiting for lock set this to 0,
* and manually check for lock using \ref Cy_SysClk_FllGetLockStatus.
*
* \return Error / status code:<br>
* CY_SYSCLK_SUCCESS - FLL successfully enabled<br>
* CY_SYSCLK_TIMEOUT - Timeout waiting for FLL lock
*
*******************************************************************************/
uint32_t Cy_SysClk_FllEnable(uint32_t timeoutus);

/*******************************************************************************
* Function Name: Cy_SysClk_FllGetLockStatus
****************************************************************************//**
*
* Returns lock status of the FLL
*
* \return 0 = not locked, 1 = locked
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_FllGetLockStatus(void)
{
    return (uint32_t)(_FLD2VAL(SRSS_CLK_FLL_STATUS_LOCKED, SRSS->CLK_FLL_STATUS));
}

/*******************************************************************************
* Function Name: Cy_SysClk_FllLostLock
****************************************************************************//**
*
* Reports whether or not the FLL lost its lock since the last time this function
* was called. Clears the lost lock indicator.
*
* \return 0 = didn't lose lock, 1 = lost lock
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_FllLostLock(void)
{
    uint32_t retval = _FLD2VAL(SRSS_CLK_FLL_STATUS_UNLOCK_OCCURRED, SRSS->CLK_FLL_STATUS);
    /* write a 1 to clear the unlock occurred bit */
    SRSS->CLK_FLL_STATUS = _VAL2FLD(SRSS_CLK_FLL_STATUS_UNLOCK_OCCURRED, 1u);
    return (retval);
}

/*******************************************************************************
* Function Name: Cy_SysClk_FllDisable
****************************************************************************//**
*
* Disables the FLL and the CCO.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_FllDisable(void)
{
    SRSS->CLK_FLL_CONFIG  &= ~_VAL2FLD(SRSS_CLK_FLL_CONFIG_FLL_ENABLE,  1u); /* 0 = disable */
    SRSS->CLK_FLL_CONFIG4 &= ~_VAL2FLD(SRSS_CLK_FLL_CONFIG4_CCO_ENABLE, 1u); /* 0 = disable */
}
/** \} group_sysclk_fll */


/**
* \addtogroup group_sysclk_pll
* \{
*/

/* ========================================================================== */
/* ===========================    PLL SECTION    ============================ */
/* ========================================================================== */
/*******************************************************************************
* Function Name: Cy_SysClk_PllConfigure
****************************************************************************//**
*
* Configures a given PLL.
* The configuration formula used is:
*   Fout = pll_clk * (P / Q / div_out), where:
*     Fout is the desired output frequency
*     pll_clk is the frequency of the input source
*     P is the feedback divider. Its value is in bitfield FEEDBACK_DIV.
*     Q is the reference divider. Its value is in bitfield REFERENCE_DIV.
*     div_out is the reference divider. Its value is in bitfield OUTPUT_DIV.
*
* \param clkPath Selects which PLL to configure. 1 is the first PLL; 0 is invalid.
*
* \param inputFreq frequency of input source, in Hz; allowed range is 4 MHz to 64 MHz.
*
* \param outputFreq desired output frequency, in Hz; allowed range 1 MHz to 400 MHz, in 4-MHz steps.
*
* \param outputMode \ref cy_en_fll_pll_output_mode_t. If output mode is bypass, then
* the output frequency equals the input source frequency regardless of the
* frequency parameter values.
*
* \return  Error / status code:<br>
* CY_SYSCLK_SUCCESS - PLL successfully configured<br>
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is enabled<br>
* CY_SYSCLK_BAD_PARAM - invalid clock path number, or input or desired output frequency is out of valid range
*
* \note
* Do not call this function when the PLL is enabled. If it is, then this function
* returns immediately with an error return value and no register updates.
*******************************************************************************/
uint32_t Cy_SysClk_PllConfigure(uint32_t clkPath, uint32_t inputFreq, uint32_t outputFreq,
                                cy_en_fll_pll_output_mode_t outputMode);

/*******************************************************************************
* Function Name: Cy_SysClk_PllManualConfigure
****************************************************************************//**
*
* Manually configures a PLL based on user inputs.
*
* \param clkPath Selects which PLL to configure. 1 is the first PLL; 0 is invalid.
*
* \param feedbackDiv
* Sets the feedback divider for the selected PLL, valid range is 1 to 50
*
* \param referenceDiv
* Sets reference divider of PLL, valid range is 1 to 31. (Input Frequency /
* reference divider must be in the range of 4 MHz to 8 MHz.
*
* \param outputDiv
* Sets the output divider, valid range is 1 to 255. To use the PLL as the source
* of an hf_clk this value must be 2 or greater.
*
* \param outputMode
* \ref cy_en_fll_pll_output_mode_t
*
* \return  Error / status code:<br>
* CY_SYSCLK_SUCCESS - PLL successfully configured<br>
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is enabled<br>
* CY_SYSCLK_BAD_PARAM - invalid clock path number
*
* \note
* Do not call this function when the PLL is enabled. If it is, then this function
* returns immediately with an error return value and no register updates.
*******************************************************************************/
uint32_t Cy_SysClk_PllManualConfigure(uint32_t clkPath, uint32_t feedbackDiv, uint32_t referenceDiv,
                                      uint32_t outputDiv, cy_en_fll_pll_output_mode_t outputMode);

