ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/sysclk/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_PllGetConfiguration
****************************************************************************//**
*
* Reports configuration settings for a PLL.
*
* \param clkPath Selects which PLL to report. 1 is the first PLL; 0 is invalid.
*
* \param feedbackDiv
* Pointer to storage for the feedback divider for the selected PLL.
*
* \param referenceDiv
* Pointer to storage for the reference divider for the selected PLL.
*
* \param outputDiv
* Pointer to storage for the output divider for the selected PLL.
*
* \param outputMode
* \ref cy_en_fll_pll_output_mode_t
*
*
* \return  Error / status code:<br>
* CY_SYSCLK_SUCCESS - PLL data successfully reported<br>
* CY_SYSCLK_BAD_PARAM - invalid clock path number
*
*******************************************************************************/
uint32_t Cy_SysClk_PllGetConfiguration(uint32_t clkPath, uint32_t *feedbackDiv, uint32_t *referenceDiv,
                                       uint32_t *outputDiv, cy_en_fll_pll_output_mode_t *outputMode);

/*******************************************************************************
* Function Name: Cy_SysClk_PllEnable
****************************************************************************//**
*
* Enables the PLL. The PLL should be configured before calling this function.
*
* \param clkPath Selects which PLL to enable. 1 is the first PLL; 0 is invalid.
*
* \param timeoutus amount of time in microseconds to wait for the PLL to lock.
* If lock doesn't occur, PLL is stopped. To avoid waiting for lock set this to 0,
* and manually check for lock using \ref Cy_SysClk_PllGetLockStatus.
*
* \return Error / status code:<br>
* CY_SYSCLK_SUCCESS - PLL successfully enabled<br>
* CY_SYSCLK_TIMEOUT - Timeout waiting for PLL lock<br>
* CY_SYSCLK_BAD_PARAM - invalid clock path number
*
*******************************************************************************/
uint32_t Cy_SysClk_PllEnable(uint32_t clkPath, uint32_t timeoutus);

/*******************************************************************************
* Function Name: Cy_SysClk_PllGetLockStatus
****************************************************************************//**
*
* Reports the lock status of the selected PLL.
*
* \param clkPath Selects which PLL to check. 1 is the first PLL; 0 is invalid.
*
* \return 0 = not locked, 1 = locked, 0xFF = invalid clock path number
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_PllGetLockStatus(uint32_t clkPath)
{
    uint32_t retval = 0xFFul; /* invalid clock path number */
    if ((clkPath != 0ul) && (clkPath <= SRSS_NUM_PLL))
    {
        retval = _FLD2VAL(SRSS_CLK_PLL_STATUS_LOCKED, SRSS->CLK_PLL_STATUS[clkPath - 1ul]);
    }
    return (retval);
}

/*******************************************************************************
* Function Name: Cy_SysClk_PllLostLock
****************************************************************************//**
*
* Reports whether or not the selected PLL lost its lock since the last time this
* function was called. Clears the lost lock indicator.
*
* \param clkPath Selects which PLL to check. 1 is the first PLL; 0 is invalid.
*
* \return 0 = didn't lose lock, 1 = lost lock, 0xFF = invalid clock path number
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_PllLostLock(uint32_t clkPath)
{
    uint32_t retval = 0xFFul; /* invalid clock path number */
    if ((clkPath != 0ul) && (clkPath <= SRSS_NUM_PLL))
    {
        retval = _FLD2VAL(SRSS_CLK_PLL_STATUS_UNLOCK_OCCURRED, SRSS->CLK_PLL_STATUS[clkPath - 1ul]);
        /* write a 1 to clear the unlock occurred bit */
        SRSS->CLK_PLL_STATUS[clkPath - 1ul] = _VAL2FLD(SRSS_CLK_PLL_STATUS_UNLOCK_OCCURRED, 1u);
    }
    return (retval);
}

/*******************************************************************************
* Function Name: Cy_SysClk_PllDisable
****************************************************************************//**
*
* Disables the selected PLL.
*
* \param clkPath Selects which PLL to disable. 1 is the first PLL; 0 is invalid.
*
* \return Error / status code:<br>
* CY_SYSCLK_SUCCESS - PLL successfully disabled<br>
* CY_SYSCLK_BAD_PARAM - invalid clock path number
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_PllDisable(uint32_t clkPath)
{
    uint32_t retval = CY_SYSCLK_BAD_PARAM;
    if ((clkPath != 0ul) && (clkPath <= SRSS_NUM_PLL))
    {
        SRSS->CLK_PLL_CONFIG[clkPath - 1ul] &= ~_VAL2FLD(SRSS_CLK_PLL_CONFIG_ENABLE, 1u); /* 0 = disable */
        retval = CY_SYSCLK_SUCCESS;
    }
    return (retval);
}
/** \} group_sysclk_pll */


/**
* \addtogroup group_sysclk_ilo
* \{
*/

/* ========================================================================== */
/* ===========================    ILO SECTION    ============================ */
/* ========================================================================== */
/** ILO trim modes */
typedef enum
{
    CY_SYSCLK_ILO_TRIM_BLOCKING = 0u,   /**< Function doesn't return until trim completes. */
    CY_SYSCLK_ILO_TRIM_NONBLOCKING = 1u /**< Function returns immediately, must be called multiple times until it is finished. */
} cy_en_ilo_trim_modes_t;

/*******************************************************************************
* Function Name: Cy_SysClk_IloEnable
****************************************************************************//**
*
* Enables the ILO.
*
* \note The watchdog timer (WDT) must be unlocked before calling this function.
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_IloEnable(void)
{
    SRSS->CLK_ILO_CONFIG |= _VAL2FLD(SRSS_CLK_ILO_CONFIG_ENABLE, 1u); /* 1 = enable */
}

/*******************************************************************************
* Function Name: Cy_SysClk_IloDisable
****************************************************************************//**
*
* Disables the ILO. ILO can't be disabled if WDT is enabled.
*
* \note The watchdog timer (WDT) must be unlocked before calling this function.
* Do not call this function if the WDT is enabled, because the WDT is clocked by
* the ILO.
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_IloDisable(void)
{
    SRSS->CLK_ILO_CONFIG &= ~_VAL2FLD(SRSS_CLK_ILO_CONFIG_ENABLE, 1u); /* 0 = disable */
}

