ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/sysclk/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_IloHibernateOn
****************************************************************************//**
*
* Controls whether the ILO stays on during a hibernate, or through an XRES or
* brown-out detect (BOD) event.
*
* \param on
* 1 = ILO stays on during hibernate or across XRES/BOD. 0 = ILO turns off for
* hibernate or XRES/BOD.
*
* \note Writes to the register/bit are ignored if the watchdog (WDT) is locked.
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_IloHibernateOn(bool on)
{
    CY_SYSCLK_CLR_SET(SRSS->CLK_ILO_CONFIG, SRSS_CLK_ILO_CONFIG_HVILO_BACKUP, (uint32_t)on);
}
/** \} group_sysclk_ilo */


/**
* \addtogroup group_sysclk_pilo
* \{
*/

/* ========================================================================== */
/* ===========================    PILO SECTION    =========================== */
/* ========================================================================== */
/*******************************************************************************
* Function Name: Cy_SysClk_PiloEnable
****************************************************************************//**
*
* Enables the PILO.
*
* \note Requires 1 msec, for delay between enabling the PILO and releasing the
* PILO reset.
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_PiloEnable(void)
{
    SRSS->CLK_PILO_CONFIG |= _VAL2FLD(SRSS_CLK_PILO_CONFIG_PILO_EN, 1u); /* 1 = enable */
    Cy_SysLib_Delay(1/*msec*/);
    /* release the reset and enable clock output */
    SRSS->CLK_PILO_CONFIG |= (_VAL2FLD(SRSS_CLK_PILO_CONFIG_PILO_RESET_N, 1u) |
                              _VAL2FLD(SRSS_CLK_PILO_CONFIG_PILO_CLK_EN, 1u));
}

/*******************************************************************************
* Function Name: Cy_SysClk_PiloDisable
****************************************************************************//**
*
* Disables the PILO.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_PiloDisable(void)
{
    /* Clear PILO_EN, PILO_RESET_N, and PILO_CLK_EN bitfields. This disables the
       PILO and holds the PILO in a reset state. */
    SRSS->CLK_PILO_CONFIG &= ~(_VAL2FLD(SRSS_CLK_PILO_CONFIG_PILO_EN, 1u)      |
                               _VAL2FLD(SRSS_CLK_PILO_CONFIG_PILO_RESET_N, 1u) |
                               _VAL2FLD(SRSS_CLK_PILO_CONFIG_PILO_CLK_EN, 1u));}
/** \} group_sysclk_pilo */


/**
* \addtogroup group_sysclk_calclk
* \{
*/

/* ========================================================================== */
/* ====================    CLOCK MEASUREMENT SECTION    ===================== */
/* ========================================================================== */
/** Defines all possible clock sources. */
typedef enum
{
    CY_SYSCLK_MEAS_CLK_ILO =           1u,
    CY_SYSCLK_MEAS_CLK_WCO =           2u,
    CY_SYSCLK_MEAS_CLK_ALTLF =         4u,
    CY_SYSCLK_MEAS_CLK_IMO =           6u,
    CY_SYSCLK_MEAS_CLK_PILO =          8u,
    CY_SYSCLK_MEAS_CLK_FAST_CLKS =     0x100u,
    CY_SYSCLK_MEAS_CLK_ECO =           0x101u,
    CY_SYSCLK_MEAS_CLK_EXT =           0x102u,
    CY_SYSCLK_MEAS_CLK_ALTHF =         0x103u,
    CY_SYSCLK_MEAS_CLK_PATH_CLKS =     0x500u,
    CY_SYSCLK_MEAS_CLK_PATH0 =            0x500u,
    CY_SYSCLK_MEAS_CLK_PATH1 =            0x501u,
    CY_SYSCLK_MEAS_CLK_PATH2 =            0x502u,
    CY_SYSCLK_MEAS_CLK_PATH3 =            0x503u,
    CY_SYSCLK_MEAS_CLK_PATH4 =            0x504u,
    CY_SYSCLK_MEAS_CLK_PATH5 =            0x505u,
    CY_SYSCLK_MEAS_CLK_PATH6 =            0x506u,
    CY_SYSCLK_MEAS_CLK_PATH7 =            0x507u,
    CY_SYSCLK_MEAS_CLK_PATH8 =            0x508u,
    CY_SYSCLK_MEAS_CLK_PATH9 =            0x509u,
    CY_SYSCLK_MEAS_CLK_PATH10 =        0x50Au,
    CY_SYSCLK_MEAS_CLK_PATH11 =        0x50Bu,
    CY_SYSCLK_MEAS_CLK_PATH12 =        0x50Cu,
    CY_SYSCLK_MEAS_CLK_PATH13 =        0x50Du,
    CY_SYSCLK_MEAS_CLK_PATH14 =        0x50Eu,
    CY_SYSCLK_MEAS_CLK_PATH15 =        0x50Fu,
    CY_SYSCLK_MEAS_CLK_HF_CLKS =       0x600u,
    CY_SYSCLK_MEAS_CLK_HFCLK0 =        0x600u,
    CY_SYSCLK_MEAS_CLK_HFCLK1 =        0x601u,
    CY_SYSCLK_MEAS_CLK_HFCLK2 =        0x602u,
    CY_SYSCLK_MEAS_CLK_HFCLK3 =        0x603u,
    CY_SYSCLK_MEAS_CLK_HFCLK4 =        0x604u,
    CY_SYSCLK_MEAS_CLK_HFCLK5 =        0x605u,
    CY_SYSCLK_MEAS_CLK_HFCLK6 =        0x606u,
    CY_SYSCLK_MEAS_CLK_HFCLK7 =        0x607u,
    CY_SYSCLK_MEAS_CLK_HFCLK8 =        0x608u,
    CY_SYSCLK_MEAS_CLK_HFCLK9 =        0x609u,
    CY_SYSCLK_MEAS_CLK_HFCLK10 =       0x60Au,
    CY_SYSCLK_MEAS_CLK_HFCLK11 =       0x60Bu,
    CY_SYSCLK_MEAS_CLK_HFCLK12 =       0x60Cu,
    CY_SYSCLK_MEAS_CLK_HFCLK13 =       0x60Du,
    CY_SYSCLK_MEAS_CLK_HFCLK14 =       0x60Eu,
    CY_SYSCLK_MEAS_CLK_HFCLK15 =       0x60Fu,
    CY_SYSCLK_MEAS_CLK_LAST_CLK =      0x610u
} cy_en_meas_clks_t;

/*******************************************************************************
* Function Name: Cy_SysClk_InitClkMeasurementCounters
****************************************************************************//**
*
* Initializes clock measurement counters.
* Measurement counters allow you to measure one clock (clock2) versus another
* clock (clock1). This is done with two hardware counters. One counter (counter1),
* which is clocked off of clock1, is loaded with an initial value and it counts down.
* A second counter (counter2), which is clocked off of clock2, counts up until
* the first counter is done counting down.
* The frequency of clock2 can be determined with the following equation:
* clock2 frequency = (count2/count1) * clock1 frequency
*
* \param clock1 selects which clock is used as the measurement clock
*
* \param clock1FreqHz the frequency of clock1 in Hz
*
* \param count1 sets the initial value for count1
*
* \param clock2 selects the clock that will be measured by clock1
*
* \return Error / status code:<br>
* CY_SYSCLK_INVALID_STATE if already doing a measurement<br>
* CY_SYSCLK_BAD_PARAM if invalid clock input parameter<br>
* else CY_SYSCLK_SUCCESS
*
*******************************************************************************/
uint32_t Cy_SysClk_InitClkMeasurementCounters(cy_en_meas_clks_t clock1, uint32_t clock1FreqHz,
                                           uint32_t count1, cy_en_meas_clks_t clock2);

