ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/sysclk/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_StartClkMeasurementCounters
****************************************************************************//**
*
* Starts the calibration counters.
*
* \return Error / status code:<br>
* CY_SYSCLK_INVALID_STATE if already doing a measurement<br>
* else CY_SYSCLK_SUCCESS
*
* \note Cy_SysClk_InitClkMeasurementCounters() must have been called previously.
*******************************************************************************/
uint32_t Cy_SysClk_StartClkMeasurementCounters(void);

/*******************************************************************************
* Function Name: Cy_SysClk_ClkMeasurementCountersDone
****************************************************************************//**
*
* Checks if the calibration counters are done
*
* \return Status of calibration counters:<br>
* CY_SYSCLK_FINISHED if done<br>
* CY_SYSCLK_STARTED if not
*
*******************************************************************************/
__STATIC_INLINE int32_t Cy_SysClk_ClkMeasurementCountersDone(void)
{
    return ((_FLD2VAL(SRSS_CLK_CAL_CNT1_CAL_COUNTER_DONE, SRSS->CLK_CAL_CNT1) == 0ul/*0 = not done*/) ?
            CY_SYSCLK_STARTED : CY_SYSCLK_FINISHED);
}

/*******************************************************************************
* Function Name: Cy_SysClk_ClkMeasurementCountersGetClock2Freq
****************************************************************************//**
*
* Returns the frequency of clock 2 in Hz. The following equation is used:
* clock2 frequency = (count2/count1) * clock1 frequency
*
* \return Frequency of clock 2 in Hz
*
* \note This must only be called if the counters are done.
*******************************************************************************/
uint32_t Cy_SysClk_ClkMeasurementCountersGetClock2Freq(void);
/** \} group_sysclk_calclk */


/**
* \addtogroup group_sysclk_trim
* \{
*/

/* ========================================================================== */
/* ==========================    TRIM SECTION    ============================ */
/* ========================================================================== */
/*******************************************************************************
* Function Name: Cy_SysClk_IloTrim
****************************************************************************//**
*
* Trims the ILO to be as close to 32,768 Hz as possible. The clock measurement
* counters should be used to obtain the current frequency of the ILO. This
* frequency should then be passed into this function. This function will then
* use this information to trim the ILO as close as possible to 32,768 Hz.
*
* \param iloFreq current ILO frequency as measured by the measurement counters
*
* \return The achieved ILO frequency in Hz
*
* \note The watchdog timer (WDT) must be unlocked before calling this function.
*******************************************************************************/
uint32_t Cy_SysClk_IloTrim(uint32_t iloFreq);

/*******************************************************************************
* Function Name: Cy_SysClk_PiloTrim
****************************************************************************//**
*
* Trims the PILO to be as close to 32,768 Hz as possible. The clock measurement
* counters should be used to obtain the current frequency of the PILO. This
* frequency should then be passed into this function. This function will then
* use this information to trim the PILO as close as possible to 32,768Hz.
*
* \param piloFreq current PILO frequency as measured by the measurement counters
*
* \return The achieved PILO frequency in Hz
*
*******************************************************************************/
uint32_t Cy_SysClk_PiloTrim(uint32_t piloFreq);

/** \} group_sysclk_trim */


/**
* \addtogroup group_sysclk_wco
* \{
*/

/* ========================================================================== */
/* ===========================    WCO SECTION    ============================ */
/* ========================================================================== */
/** WCO bypass modes */
typedef enum
{
    CY_SYSCLK_WCO_NOT_BYPASSED = 0u, /**< WCO is not bypassed crystal is used */
    CY_SYSCLK_WCO_BYPASSED = 1u      /**< WCO is bypassed external clock must be supplied  on XTAL pin */
} cy_en_wco_bypass_modes_t;

/** WCO CSV supervisor clock selections */
typedef enum
{
    CY_SYSCLK_WCO_CSV_SUPERVISOR_ILO,
    CY_SYSCLK_WCO_CSV_SUPERVISOR_ALTLF,
    CY_SYSCLK_WCO_CSV_SUPERVISOR_PILO
} cy_en_wco_csv_supervisor_clock_t;

/**
* Clock supervisor clock loss window. There must be one clock of the supervised
* clock within this many clocks of the supervising clock.
* See registers CLK_CSV_HF_CTL and CLK_CSV_WCO_CTL, bitfield CSV_LOSS_WINDOW.
*/
typedef enum
{
    CY_SYSCLK_CSV_LOSS_4_CYCLES =   0u, /**< 1 clock must be seen within 4 cycles of the supervising clock. */
    CY_SYSCLK_CSV_LOSS_8_CYCLES =   1u, /**< 1 clock must be seen within 8 cycles of the supervising clock. */
    CY_SYSCLK_CSV_LOSS_16_CYCLES =  2u, /**< 1 clock must be seen within 16 cycles of the supervising clock. */
    CY_SYSCLK_CSV_LOSS_32_CYCLES =  3u, /**< 1 clock must be seen within 32 cycles of the supervising clock. */
    CY_SYSCLK_CSV_LOSS_64_CYCLES =  4u, /**< 1 clock must be seen within 64 cycles of the supervising clock. */
    CY_SYSCLK_CSV_LOSS_128_CYCLES = 5u, /**< 1 clock must be seen within 128 cycles of the supervising clock. */
    CY_SYSCLK_CSV_LOSS_256_CYCLES = 6u, /**< 1 clock must be seen within 256 cycles of the supervising clock. */
    CY_SYSCLK_CSV_LOSS_512_CYCLES = 7u  /**< 1 clock must be seen within 512 cycles of the supervising clock. */
} cy_en_csv_loss_window_t;

/**
* Clock supervisor error actions. See register CLK_CSV_HF_CTL[CSV_FREQ_ACTION and CSV_LOSS_ACTION].
*/
typedef enum
{
    CY_SYSCLK_CSV_ERROR_IGNORE = 0u,     /**< Ignore the error reported by the clock supervisor. */
    CY_SYSCLK_CSV_ERROR_FAULT = 1u,      /**< Trigger a fault when an error is reported by the clock supervisor. */
    CY_SYSCLK_CSV_ERROR_RESET = 2u,      /**< Trigger a reset when an error is reported by the clock supervisor. */
    CY_SYSCLK_CSV_ERROR_FAULT_RESET = 3u /**< Trigger a fault then reset when an error is reported by the supervisor. */
} cy_en_csv_error_actions_t;

/**
* This structure is used to configure the clock supervisor for the WCO.
*/
typedef struct
{
    cy_en_wco_csv_supervisor_clock_t SupervisorClock; /**< supervisor clock selection */
    uint32_t enableLossDetection;                  /**< 1= enabled, 0= disabled. Note that if loss detection is enabled, writes to other register bits are ignored. */
    cy_en_csv_loss_window_t LossWindow;               /**< \ref cy_en_csv_loss_window_t */
    cy_en_csv_error_actions_t LossAction;             /**< \ref cy_en_csv_error_actions_t */
} cy_stc_wco_csv_config_t;

