ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/sysclk/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_WcoEnable
****************************************************************************//**
*
* Enables the WCO.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_WcoEnable(void)
{
    BACKUP->CTL |= _VAL2FLD(BACKUP_CTL_WCO_EN, 1u); /* 1 = enable */
}

/*******************************************************************************
* Function Name: Cy_SysClk_WcoDisable
****************************************************************************//**
*
* Disables the WCO.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_WcoDisable(void)
{
    BACKUP->CTL &= ~_VAL2FLD(BACKUP_CTL_WCO_EN, 1u); /* 0 = disable */
}

/*******************************************************************************
* Function Name: Cy_SysClk_WcoBypass
****************************************************************************//**
*
* Sets whether the WCO is bypassed or not. If it is bypassed then a 32-kHz clock
* must be provided on the wco_in pin.
*
* \param bypass \ref cy_en_wco_bypass_modes_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_WcoBypass(cy_en_wco_bypass_modes_t bypass)
{
    CY_SYSCLK_CLR_SET(BACKUP->CTL, BACKUP_CTL_WCO_BYPASS, bypass);
}

/*******************************************************************************
* Function Name: Cy_SysClk_WcoConfigureCsv
****************************************************************************//**
*
* Configure the WCO clock supervisor (CSV).
*
* \param config \ref cy_stc_wco_csv_config_t
*
* \note
* If loss detection is enabled, writes to other register bits are ignored.
* Therefore loss detection is disabled before writing the config structure
* members to the CTL register. Note that one of the config structure members is
* an enable bit.
*******************************************************************************/
void Cy_SysClk_WcoConfigureCsv(const cy_stc_wco_csv_config_t *config);
/** \} group_sysclk_wco */


/**
* \addtogroup group_sysclk_clk_hf
* \{
*/

/* ========================================================================== */
/* ========================    clk_hf[n] SECTION    ========================= */
/* ========================================================================== */
/**
* Selects which hf_clk input, or root mux, to configure.
* See CLK_ROOT_SELECT registers, bits ROOT_MUX.
* Used with functions \ref Cy_SysClk_HfClockSetSource and \ref Cy_SysClk_HfClockGetSource.
*/
typedef enum
{
    CY_SYSCLK_HFCLK_IN_CLKPATH0  = 0u,  /**< hf_clk input is Clock Path 0 */
    CY_SYSCLK_HFCLK_IN_CLKPATH1  = 1u,  /**< hf_clk input is Clock Path 1 */
    CY_SYSCLK_HFCLK_IN_CLKPATH2  = 2u,  /**< hf_clk input is Clock Path 2 */
    CY_SYSCLK_HFCLK_IN_CLKPATH3  = 3u,  /**< hf_clk input is Clock Path 3 */
    CY_SYSCLK_HFCLK_IN_CLKPATH4  = 4u,  /**< hf_clk input is Clock Path 4 */
    CY_SYSCLK_HFCLK_IN_CLKPATH5  = 5u,  /**< hf_clk input is Clock Path 5 */
    CY_SYSCLK_HFCLK_IN_CLKPATH6  = 6u,  /**< hf_clk input is Clock Path 6 */
    CY_SYSCLK_HFCLK_IN_CLKPATH7  = 7u,  /**< hf_clk input is Clock Path 7 */
    CY_SYSCLK_HFCLK_IN_CLKPATH8  = 8u,  /**< hf_clk input is Clock Path 8 */
    CY_SYSCLK_HFCLK_IN_CLKPATH9  = 9u,  /**< hf_clk input is Clock Path 9 */
    CY_SYSCLK_HFCLK_IN_CLKPATH10 = 10u, /**< hf_clk input is Clock Path 10 */
    CY_SYSCLK_HFCLK_IN_CLKPATH11 = 11u, /**< hf_clk input is Clock Path 11 */
    CY_SYSCLK_HFCLK_IN_CLKPATH12 = 12u, /**< hf_clk input is Clock Path 12 */
    CY_SYSCLK_HFCLK_IN_CLKPATH13 = 13u, /**< hf_clk input is Clock Path 13 */
    CY_SYSCLK_HFCLK_IN_CLKPATH14 = 14u, /**< hf_clk input is Clock Path 14 */
    CY_SYSCLK_HFCLK_IN_CLKPATH15 = 15u, /**< hf_clk input is Clock Path 15 */
} cy_en_hf_clk_sources_t;

/**
* hf_clk divider values. See CLK_ROOT_SELECT registers, bits ROOT_DIV.
* Used with functions \ref Cy_SysClk_HfClockSetDivider and \ref Cy_SysClk_HfClockGetDivider.
*/
typedef enum
{
    CY_SYSCLK_HFCLK_NO_DIVIDE   = 0u,    /**< don't divide hf_clk. */
    CY_SYSCLK_HFCLK_DIVIDE_BY_2 = 1u,    /**< divide hf_clk by 2 */
    CY_SYSCLK_HFCLK_DIVIDE_BY_4 = 2u,    /**< divide hf_clk by 4 */
    CY_SYSCLK_HFCLK_DIVIDE_BY_8 = 3u     /**< divide hf_clk by 8 */
} cy_en_hf_clk_dividers_t;

/**
* hf_clk clock supervisor input sources. See register CLK_CSV_HF_CTL[CSV_MUX].
*/
typedef enum
{
    CY_SYSCLK_HFCLK_CSV_SUPERVISOR_IMO   = 0u,  /**< Supervising clock is the IMO. */
    CY_SYSCLK_HFCLK_CSV_SUPERVISOR_EXT   = 1u,  /**< Supervising clock is the external clock */
    CY_SYSCLK_HFCLK_CSV_SUPERVISOR_ALTHF = 2u   /**< Supervising clock is clk_althf */
} cy_en_hfclk_csv_supervisor_clock_t;

/**
* This structure is used to configure the clock supervisor for hf_clk.
*/
typedef struct
{
    cy_en_hfclk_csv_supervisor_clock_t SupervisorClock; /**< \ref cy_en_hfclk_csv_supervisor_clock_t */
    uint32_t SupervisingWindow;                         /**< Number of supervising clock cycles */
    uint32_t enableFrquencyFaultDetection;              /**< 1= enabled, 0= disabled */
    uint32_t FrequencyLowerLimit;                       /**< Lowest frequency in kHz that supervised clock can go */
    uint32_t FrequencyUpperLimit;                       /**< Highest frequency in kHz that supervised clock can go */
    cy_en_csv_error_actions_t FrequencyAction;          /**< \ref cy_en_csv_error_actions_t */
    uint32_t enableLossDetection;                       /**< 1= enabled, 0= disabled */
    cy_en_csv_loss_window_t LossWindow;                 /**< \ref cy_en_csv_loss_window_t */
    cy_en_csv_error_actions_t LossAction;               /**< \ref cy_en_csv_error_actions_t */
} cy_stc_hf_csv_config_t;

/*******************************************************************************
* Function Name: Cy_SysClk_ClkHfEnable
****************************************************************************//**
*
* Enables the selected ClkHf.
*
* \param clkHf Selects which ClkHf to enable.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_ClkHfEnable(uint32_t clkHf)
{
    SRSS->CLK_ROOT_SELECT[clkHf] |= _VAL2FLD(SRSS_CLK_ROOT_SELECT_ENABLE, 1ul); /* 1 = enable */
}

