ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/sysclk/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_ClkHfDisable
****************************************************************************//**
*
* Disables the selected ClkHf.
*
* \param clkHf Selects which ClkHf to enable.
*
* \note ClkHf[0] cannot be disabled.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_ClkHfDisable(uint32_t clkHf)
{
    SRSS->CLK_ROOT_SELECT[clkHf] &= ~_VAL2FLD(SRSS_CLK_ROOT_SELECT_ENABLE, 1ul); /* 0 = disable */
}

/*******************************************************************************
* Function Name: Cy_SysClk_HfClockSetSource
****************************************************************************//**
*
* Selects the source of the selected ClkHf.
*
* \param hfClk Which ClkHf mux to configure.
*
* \param source \ref cy_en_hf_clk_sources_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_HfClockSetSource(uint32_t hfClk, cy_en_hf_clk_sources_t source)
{
    CY_SYSCLK_CLR_SET(SRSS->CLK_ROOT_SELECT[hfClk], SRSS_CLK_ROOT_SELECT_ROOT_MUX, source);
}

/*******************************************************************************
* Function Name: Cy_SysClk_HfClockGetSource
****************************************************************************//**
*
* Reports the source of the selected ClkHf.
*
* \param hfClk selects which ClkHf to get the source of.
*
* \return \ref cy_en_hf_clk_sources_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_hf_clk_sources_t Cy_SysClk_HfClockGetSource(uint32_t hfClk)
{
    return (cy_en_hf_clk_sources_t)(_FLD2VAL(SRSS_CLK_ROOT_SELECT_ROOT_MUX, SRSS->CLK_ROOT_SELECT[hfClk]));
}

/*******************************************************************************
* Function Name: Cy_SysClk_HfClockSetDivider
****************************************************************************//**
*
* Sets the pre-divider for a ClkHf.
*
* \param hfClk selects which ClkHf divider to configure.
*
* \param divider \ref cy_en_hf_clk_dividers_t
*
* \note Also call \ref Cy_SysClk_HfClockSetSource to set the ClkHf source.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_HfClockSetDivider(uint32_t hfClk, cy_en_hf_clk_dividers_t divider)
{
    CY_SYSCLK_CLR_SET(SRSS->CLK_ROOT_SELECT[hfClk], SRSS_CLK_ROOT_SELECT_ROOT_DIV, divider);
}

/*******************************************************************************
* Function Name: Cy_SysClk_HfClockGetDivider
****************************************************************************//**
*
* Reports the pre-divider value for a ClkHf.
*
* \param hfClk selects which ClkHf to check divider of.
*
* \return \ref cy_en_hf_clk_dividers_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_hf_clk_dividers_t Cy_SysClk_HfClockGetDivider(uint32_t hfClk)
{
    return (cy_en_hf_clk_dividers_t)(_FLD2VAL(SRSS_CLK_ROOT_SELECT_ROOT_DIV, SRSS->CLK_ROOT_SELECT[hfClk]));
}

/*******************************************************************************
* Function Name: Cy_SysClk_HfClockConfigureCsv
****************************************************************************//**
*
* Configures the ClkHf clock supervisor (CSV).
*
* \param hfClk selects which ClkHf CSV to configure.
*
* \param config \ref cy_stc_hf_csv_config_t
*
* \note
* If loss detection is enabled, writes to other register bits are ignored.
* Therefore loss detection is disabled before writing the config structure
* members to the CTL register. Note that one of the config structure members is
* an enable bit.
*******************************************************************************/
void Cy_SysClk_HfClockConfigureCsv(uint32_t hfClk, const cy_stc_hf_csv_config_t *config);
/** \} group_sysclk_clk_hf */


/**
* \addtogroup group_sysclk_clk_fast
* \{
*/

/* ========================================================================== */
/* =========================    clk_fast SECTION    ========================= */
/* ========================================================================== */
/*******************************************************************************
* Function Name: Cy_SysClk_FastClkSetDivider
****************************************************************************//**
*
* Sets the clock divider for the fast clock, which sources the main processor.
* The source of this divider is hf_clk[0].
*
* \param divider divider value between 0 and 255.
* Causes integer division of (divider value + 1), or division by 1 to 256.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_FastClkSetDivider(uint32_t divider)
{
    CY_SYSCLK_CLR_SET(CPUSS->CM4_CLOCK_CTL, CPUSS_CM4_CLOCK_CTL_FAST_INT_DIV, divider);
}

/*******************************************************************************
* Function Name: Cy_SysClk_FastClkGetDivider
****************************************************************************//**
*
* Returns the clock divider for the fast clock.
*
* \return The divider value for the fast clock.
* The integer division done is by (divider value + 1), or division by 1 to 256.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_FastClkGetDivider(void)
{
    return _FLD2VAL(CPUSS_CM4_CLOCK_CTL_FAST_INT_DIV, CPUSS->CM4_CLOCK_CTL);
}
/** \} group_sysclk_clk_fast */


/**
* \addtogroup group_sysclk_clk_peripheral
* \{
*/

/* ========================================================================== */
/* ========================    clk_peri SECTION    ========================== */
/* ========================================================================== */
/** Programmable clock divider types */
typedef enum
{
    CY_SYSCLK_DIV_8_BIT    = 0u, /**< Divider Type is an 8 bit divider */
    CY_SYSCLK_DIV_16_BIT   = 1u, /**< Divider Type is a 16 bit divider */
    CY_SYSCLK_DIV_16_5_BIT = 2u, /**< Divider Type is a 16.5 bit fractional divider */
    CY_SYSCLK_DIV_24_5_BIT = 3u  /**< Divider Type is a 24.5 bit fractional divider */
} cy_en_divider_types_t;

