ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/sysclk/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_PeriphPhaseAlignDivider
****************************************************************************//**
*
* First disables a selected divider (\ref Cy_SysClk_PeriphPhaseDisableDivider),
* then aligns that divider to another programmable divider, and enables the
* selected divider.
*
* \param dividerType specifies which type of divider to use; \ref cy_en_divider_types_t.
*
* \param dividerNum specifies which divider of the selected type to configure.
*
* \param dividerTypePA type of divider to phase-align to; \ref cy_en_divider_types_t.
*
* \param dividerNumPA divider number of type specified to phase align to.
*
* \note
* To phase-align a divider to clk_peri, set dividerTypePA to 3 and dividerNumPA
* to 255.
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_PeriphPhaseAlignDivider(cy_en_divider_types_t dividerType, uint32_t dividerNum,
                                                       cy_en_divider_types_t dividerTypePA, uint32_t dividerNumPA)
{
    /* first disable the divider that is to be phase-aligned */
    Cy_SysClk_PeriphPhaseDisableDivider(dividerType, dividerNum);
    /* then specify the reference divider, and the divider, and enable the divider */
    PERI->DIV_CMD = _VAL2FLD(PERI_DIV_CMD_ENABLE, 1u) /* 1 = enable */ |
                    _VAL2FLD(PERI_DIV_CMD_PA_TYPE_SEL, dividerTypePA) |
                    _VAL2FLD(PERI_DIV_CMD_PA_DIV_SEL,  dividerNumPA)  |
                    _VAL2FLD(PERI_DIV_CMD_TYPE_SEL,    dividerType)   |
                    _VAL2FLD(PERI_DIV_CMD_DIV_SEL,     dividerNum);
}

/*******************************************************************************
* Function Name: Cy_SysClk_PeriphGetFrequency
****************************************************************************//**
*
* Reports the frequency of the output of a given peripheral divider.
*
* \param dividerType specifies which type of divider to use; \ref cy_en_divider_types_t
*
* \param dividerNum specifies which divider of the selected type to configure
*
* \return The frequency, in Hz.
*
* \note
* The reported frequency may be zero, which indicates unknown. This happens if
* the source input is clk_ext, ECO, clk_althf, dsi_out, or clk_altlf.
*
*******************************************************************************/
uint32_t Cy_SysClk_PeriphGetFrequency(cy_en_divider_types_t dividerType, uint32_t dividerNum);
/** \} group_sysclk_clk_peripheral */


/**
* \addtogroup group_sysclk_clk_slow
* \{
*/

/* ========================================================================== */
/* =========================    clk_slow SECTION    ========================= */
/* ========================================================================== */
/*******************************************************************************
* Function Name: Cy_SysClk_SlowClkSetDivider
****************************************************************************//**
*
* Sets the clock divider for the slow clock. The source of this clock is the
* peripheral clock (ClkPeri), which is sourced from hf_clk[0].
*
* \param divider Divider value between 0 and 255.
* Causes integer division of (divider value + 1), or division by 1 to 256.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_SlowClkSetDivider(uint32_t divider)
{
    CY_SYSCLK_CLR_SET(CPUSS->CM0_CLOCK_CTL, CPUSS_CM0_CLOCK_CTL_SLOW_INT_DIV, divider);
}

/*******************************************************************************
* Function Name: Cy_SysClk_SlowClkGetDivider
****************************************************************************//**
*
* Reports the divider value for the slow clock.
*
* \return The divider value.
* The integer division done is by (divider value + 1), or division by 1 to 256.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SlowClkGetDivider(void)
{
    return _FLD2VAL(CPUSS_CM0_CLOCK_CTL_SLOW_INT_DIV, CPUSS->CM0_CLOCK_CTL);
}
/** \} group_sysclk_clk_slow */


/**
* \addtogroup group_sysclk_clk_lf
* \{
*/

/* ========================================================================== */
/* ==========================    clk_lf SECTION    ========================== */
/* ========================================================================== */
/**
* Low frequency (lf_clk) input sources. See CLK_SELECT register, LFCLK_SEL bits.
* Used with functions \ref Cy_SysClk_LfClkSetSource, and \ref Cy_SysClk_LfClkGetSource.
*/
typedef enum
{
    CY_SYSCLK_LFCLK_IN_ILO   = 0u, /**< lf_clk is sourced by the internal low speed oscillator (ILO) */
    CY_SYSCLK_LFCLK_IN_WCO   = 1u, /**< lf_clk is sourced by the watch crystal oscillator (WCO) */
    CY_SYSCLK_LFCLK_IN_ALTLF = 2u, /**< lf_clk is sourced by the Alternate Low Frequency Clock (ALTLF) */
    CY_SYSCLK_LFCLK_IN_PILO  = 3u  /**< lf_clk is sourced by the precision low speed oscillator (PILO) */
} cy_en_lfclk_input_sources_t;


/*******************************************************************************
* Function Name: Cy_SysClk_LfClkSetSource
****************************************************************************//**
*
* Sets the source for the low frequency clock(lf_clk).
*
* \param source \ref cy_en_lfclk_input_sources_t
*
* \note The watchdog timer (WDT) must be unlocked before calling this function.
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_LfClkSetSource(cy_en_lfclk_input_sources_t source)
{
    CY_SYSCLK_CLR_SET(SRSS->CLK_SELECT, SRSS_CLK_SELECT_LFCLK_SEL, source);
}

/*******************************************************************************
* Function Name: Cy_SysClk_LfClkGetSource
****************************************************************************//**
*
* Reports the source for the low frequency clock (lf_clk).
*
* \return \ref cy_en_lfclk_input_sources_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_lfclk_input_sources_t Cy_SysClk_LfClkGetSource(void)
{
    return (cy_en_lfclk_input_sources_t)(_FLD2VAL(SRSS_CLK_SELECT_LFCLK_SEL, SRSS->CLK_SELECT));
}
/** \} group_sysclk_clk_lf */


/**
* \addtogroup group_sysclk_clk_timer
* \{
*/

/* ========================================================================== */
/* ========================    clk_timer SECTION    ========================= */
/* ========================================================================== */
/**
* Timer clock (clk_timer) input sources. See CLK_TIMER_CTL register, TIMER_SEL
* and TIMER_HF0_DIV bits. Used with functions \ref Cy_SysClk_ClkTimerSetSource, and
* \ref Cy_SysClk_ClkTimerGetSource.
*/
typedef enum
{
    CY_SYSCLK_CLKTIMER_IN_IMO       =     0u, /**< clk_timer is sourced by the internal main oscillator (IMO) */
    CY_SYSCLK_CLKTIMER_IN_HF0_NODIV =     1u, /**< clk_timer is sourced by clk_hf0 undivided */
    CY_SYSCLK_CLKTIMER_IN_HF0_DIV2  = 0x101u, /**< clk_timer is sourced by clk_hf0 divided by 2 */
    CY_SYSCLK_CLKTIMER_IN_HF0_DIV4  = 0x201u, /**< clk_timer is sourced by clk_hf0 divided by 4 */
    CY_SYSCLK_CLKTIMER_IN_HF0_DIV8  = 0x301u  /**< clk_timer is sourced by clk_hf0 divided by 8 */
} cy_en_clktimer_input_sources_t;


